bobmittmann/thinkos/arch/stm32/libstm32f/otg_fs/stm32f-otg_fs_dev.c
/* 
 * Copyright(C) 2013 Robinson Mittmann. All Rights Reserved.
 * 
 * This file is part of the YARD-ICE.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 3.0 of the License, or (at your option) any later version.
 * 
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You can receive a copy of the GNU Lesser General Public License from 
 * http://www.gnu.org/
 */


/** 
 * @file stm32f-otg_fs_dev.c
 * @brief STM32F OTG USB driver
 * @author Robinson Mittmann <bobmittmann@gmail.com>
 */ 

#ifdef CONFIG_H
#include "config.h"
#endif

#include <sys/stm32f.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include <arch/cortex-m3.h>
#include <sys/delay.h>
#include <sys/usb-dev.h>
#include <sys/param.h>
#include <sys/dcclog.h>
#include <vt100.h>

#ifndef STM32_ENABLE_OTG_FS 
#define STM32_ENABLE_OTG_FS 0
#endif 

#ifndef STM32_OTG_FS_INEP_MAX
#define STM32_OTG_FS_INEP_MAX 3
#endif

#ifndef STM32_OTG_FS_OUTEP_MAX
#define STM32_OTG_FS_OUTEP_MAX 3
#endif

#ifndef STM32_OTG_FS_IO_INIT
#define STM32_OTG_FS_IO_INIT 0
#endif

#ifndef STM32_OTG_FS_VBUS_CONNECT
#define STM32_OTG_FS_VBUS_CONNECT 0
#endif

#ifndef STM32_OTG_FS_IRQ_ENABLE
#define STM32_OTG_FS_IRQ_ENABLE 0
#endif

#ifndef STM32_OTG_FS_BULK_PKTS
#define STM32_OTG_FS_BULK_PKTS 4
#endif

#ifndef STM32_OTG_FS_RX_FIFO_SIZE
#define STM32_OTG_FS_RX_FIFO_SIZE 192
#endif

#if defined(STM32F_OTG_FS) && (STM32_ENABLE_OTG_FS)

#define OTG_INEP_MAX     (STM32_OTG_FS_INEP_MAX)
#define OTG_OUTEP_MAX    (STM32_OTG_FS_OUTEP_MAX)
#define OTG_EP_MAX       ((STM32_OTG_FS_INEP_MAX) + \
						  (STM32_OTG_FS_OUTEP_MAX) + 1)
#define OTG_INEP_OFF     (OTG_OUTEP_MAX)

#define OTG_FS_MEM_SIZE    1280

#ifndef DEBUG
#define DEBUG 0
#endif

/* Endpoint state */
enum ep_state {
	EP_UNCONFIGURED = 0,
	EP_IDLE,
	EP_STALLED,
	EP_IN_DATA,
	EP_IN_DATA_ZLP,
	EP_IN_ZLP,
	EP_WAIT_STATUS_IN,
	EP_OUT_DATA,
	EP_OUT_DATA_LAST
};

/* Endpoint control */
struct stm32f_otg_ep {
	uint8_t state;
	uint8_t idx;
	uint16_t xfr_max;
	volatile uint16_t xfr_len;
	volatile uint16_t xfr_cnt;
	union {
		uint32_t xfr_dat;
		uint8_t * xfr_ptr;
	};
	uint8_t * xfr_buf;
	/* endpoint callback */
	union {
		usb_class_on_ep_ev_t on_ev;
		usb_class_on_ep_in_t on_in;
		usb_class_on_ep_out_t on_out;
		usb_class_on_ep_setup_t on_setup;
	};
};

/* USB Device runtime driver data */
struct stm32f_otg_drv {
	struct stm32f_otg_ep ep[OTG_EP_MAX];
	struct usb_class_if * cl;
	const struct usb_class_events * ev;
	struct usb_request req;
	uint16_t fifo_addr;
};

/* EP TX fifo memory allocation */
static void __ep_pktbuf_alloc(struct stm32f_otg_drv * drv, 
							  unsigned int idx, unsigned int siz)
{
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;

	if ((drv->fifo_addr + siz) > OTG_FS_MEM_SIZE) {
		DCC_LOG2(LOG_ERROR, "can't alloc memory, addr=%d siz=%d", 
				 drv->fifo_addr, siz);
		return;
	}

	switch (idx) {
	case 0:
		otg_fs->dieptxf0 = OTG_FS_TX0FD_SET(siz / 4) | 
			OTG_FS_TX0FSA_SET(drv->fifo_addr / 4);
		break;
#if (OTG_INEP_MAX > 1)
	case 1:
		otg_fs->dieptxf1 = OTG_FS_INEPTXFD_SET(siz / 4) | 
			OTG_FS_INEPTXSA_SET(drv->fifo_addr / 4);
		break;
#endif
#if (OTG_INEP_MAX > 2)
	case 2:
		otg_fs->dieptxf2 = OTG_FS_INEPTXFD_SET(siz / 4) | 
			OTG_FS_INEPTXSA_SET(drv->fifo_addr / 4);
		break;
#endif
#if (OTG_INEP_MAX > 3)
	case 3:
		otg_fs->dieptxf3 = OTG_FS_INEPTXFD_SET(siz / 4) | 
			OTG_FS_INEPTXSA_SET(drv->fifo_addr / 4);
		break;
#endif
	}

	DCC_LOG3(LOG_INFO, "addr=%d siz=%d free=%d", drv->fifo_addr, siz,
			 OTG_FS_MEM_SIZE - (drv->fifo_addr + siz));

	drv->fifo_addr += siz;
}

static inline void __copy_from_pktbuf(void * ptr,
							   volatile uint32_t * pop,
							   unsigned int cnt)
{
	uint8_t * dst = (uint8_t *)ptr;
	uint32_t data;
	unsigned int i;

	/* pop data from the fifo and copy to destination buffer */
	for (i = 0; i < (cnt + 3) / 4; i++) {
		data = *pop;
		*dst++ = data;
		*dst++ = data >> 8;
		*dst++ = data >> 16;
		*dst++ = data >> 24;
	}
}

static void __ep_zlp_send(struct stm32f_otg_fs * otg_fs, int idx)
{
	DCC_LOG(LOG_MSG, "Send: ZLP");

	otg_fs->inep[idx].dieptsiz = OTG_FS_PKTCNT_SET(1) | OTG_FS_XFRSIZ_SET(0);
	otg_fs->inep[idx].diepctl |= OTG_FS_EPENA | OTG_FS_CNAK;
}
/*
   • Setting the global OUT NAK

   1. To stop receiving any kind of data in the receive FIFO, the 
   application must set the Global OUT NAK bit by programming the 
   following field:
   – SGONAK = 1 in OTG_DCTL

   2. Wait for the assertion of the GONAKEFF interrupt in OTG_GINTSTS. 
   When asserted, this interrupt indicates that the core has stopped 
   receiving any type of data except SETUP packets.

   3. The application can receive valid OUT packets after it has set 
   SGONAK in OTG_DCTL and before the core asserts the GONAKEFF interrupt 
   (OTG_GINTSTS).

   4. The application can temporarily mask this interrupt by writing to 
   the GONAKEFFM bit in the OTG_GINTMSK register.
   – GONAKEFFM = 0 in the OTG_GINTMSK register

   5. Whenever the application is ready to exit the Global OUT NAK mode, it 
   must clear the SGONAK bit in OTG_DCTL. This also clears the GONAKEFF 
   interrupt (OTG_GINTSTS).
   – CGONAK = 1 in OTG_DCTL

   6. If the application has masked this interrupt earlier, it must be 
   unmasked as follows:
   – GONAKEFFM = 1 in OTG_GINTMSK
 */

static void __ep_out_stall_set(struct stm32f_otg_fs * otg_fs, int idx)
{
	uint32_t doepctl;

	doepctl = otg_fs->outep[idx].doepctl;
	doepctl |= OTG_FS_STALL;
	otg_fs->outep[idx].doepctl = doepctl;

/* Stalling a non-isochronous OUT endpoint
   1. Put the core in the Global OUT NAK mode. 
	otg_fs->dctl |= OTG_FS_SGONAK;

 2. Disable the required endpoint
   – When disabling the endpoint, instead of setting the SNAK bit in 
   OTG_DOEPCTL, set STALL = 1 (in OTG_DOEPCTL).
   The STALL bit always takes precedence over the NAK bit. 

 3. When the application is ready to end the STALL handshake for the 
   endpoint, the STALL bit (in OTG_DOEPCTLx) must be cleared.

