bobmittmann/thinkos/arch/stm32/libstm32f/otg_fs/stm32f-otg_fs_dev.c
   4. If the application is setting or clearing a STALL for an endpoint 
   due to a SetFeature.Endpoint Halt or ClearFeature.Endpoint Halt command, 
   the STALL bit must be set or cleared before the application sets up 
   the Status stage transfer on the control endpoint. 

	otg_fs->dctl |= OTG_FS_CGONAK; */
}

static void __ep_out_stall_clr(struct stm32f_otg_fs * otg_fs, int idx)
{
	uint32_t depctl;
	uint32_t ep_type;

	depctl = otg_fs->outep[idx].doepctl; 
	ep_type = OTG_FS_EPTYP_GET(depctl);
	if (ep_type == OTG_FS_EPTYP_INT || ep_type == OTG_FS_EPTYP_BULK)
		depctl |= OTG_FS_DPID0; /* DATA0 */
	depctl &= ~OTG_FS_STALL;
	otg_fs->outep[idx].doepctl = depctl; 
}

static void __ep_in_stall_set(struct stm32f_otg_fs * otg_fs, int idx)
{
	uint32_t diepctl;

	diepctl = otg_fs->inep[idx].diepctl;
	diepctl |= OTG_FS_STALL | ((diepctl & OTG_FS_EPENA) ? OTG_FS_EPDISD : 0);
	otg_fs->inep[idx].diepctl = diepctl; 
}

static void __ep_in_stall_clr(struct stm32f_otg_fs * otg_fs, int idx)
{
	uint32_t depctl;
	uint32_t ep_type;

	depctl = otg_fs->inep[idx].diepctl;
	ep_type = OTG_FS_EPTYP_GET(depctl);
	if (ep_type == OTG_FS_EPTYP_INT || ep_type == OTG_FS_EPTYP_BULK)
		depctl |= OTG_FS_DPID0; /* DATA0 */
	depctl &= ~OTG_FS_STALL;
	otg_fs->inep[idx].diepctl = depctl; 
}

static void __ep0_tx_setup(struct stm32f_otg_fs * otg_fs, int len)
{
	uint32_t depctl;
	uint32_t mpsiz;
	uint32_t xfrsiz;
	uint32_t pktcnt;

	depctl = otg_fs->inep[0].diepctl;
	mpsiz = OTG_FS_EP0_MPSIZ_GET(depctl);

	if (len > 0) {
		pktcnt = (len + (mpsiz - 1)) / mpsiz;
		if (pktcnt > 1) {
			pktcnt = 1;
			xfrsiz =  mpsiz * 1;
		} else {
			xfrsiz = len;
		}
	} else {
		/* zero lenght packet */
		pktcnt = 1;
		xfrsiz = 0;
	}

	DCC_LOG3(LOG_MSG, "[0] pktcnt=%d xfrsiz=%d rem=%d", 
			 pktcnt, xfrsiz, len - xfrsiz);

	otg_fs->inep[0].dieptsiz = OTG_FS_PKTCNT_SET(pktcnt) | 
		OTG_FS_XFRSIZ_SET(xfrsiz); 

	/* umask FIFO empty interrupt */
	otg_fs->diepempmsk |= (1 << 0);

}

static void __ep0_tx_push(struct stm32f_otg_drv * drv)
{
	struct stm32f_otg_ep * ep = &drv->ep[0];
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	uint32_t pktcnt;
	uint32_t diepctl;
	uint32_t dieptsiz;
	uint32_t mpsiz;
	uint32_t xfrsiz;
	uint32_t free;
	uint8_t * cp;
	int pos;
	int cnt;
	int i;

	dieptsiz = otg_fs->inep[0].dieptsiz;
	xfrsiz = OTG_FS_XFRSIZ_GET(dieptsiz);
	pktcnt = OTG_FS_PKTCNT_GET(dieptsiz);
	diepctl = otg_fs->inep[0].diepctl;

	if (xfrsiz == 0) {
		otg_fs->diepempmsk &= ~(1 << 0);
		if (pktcnt != 0) {
			DCC_LOG1(LOG_PANIC, VT_PSH VT_FGR VT_REV
					 "[0] pktcnt(%d) != 0 !!!" VT_POP, pktcnt);
			otg_fs->inep[0].diepctl = diepctl | OTG_FS_EPENA | OTG_FS_CNAK; 
		} else {
			DCC_LOG(LOG_MSG, VT_PSH VT_FGR 
					"[0] no pending data..." VT_POP);
		}
		return;
	}

	free = otg_fs->inep[0].dtxfsts * 4;
	mpsiz = OTG_FS_EP0_MPSIZ_GET(diepctl);

#if DEBUG
	(void)pktcnt;

	DCC_LOG4(LOG_MSG, VT_PSH VT_FGR 
			 "[0] mpsiz=%d pktcnt=%d xfrsiz=%d free=%d" VT_POP, 
			 mpsiz, pktcnt, xfrsiz, free);
#endif

	if (xfrsiz < mpsiz) {
		if (free < xfrsiz) {
			DCC_LOG2(LOG_ERROR, VT_PSH VT_FGR VT_REV
					 "free(%d) < xfrsiz(%d) !!!" VT_POP, free, xfrsiz);
			otg_fs->diepempmsk &= ~(1 << 0);
			return;
		}
		/* Transfer the last partial packet */
		cnt = xfrsiz;
	} else {
		if (free < mpsiz) {
			DCC_LOG2(LOG_ERROR, VT_PSH VT_FGR VT_REV
					 "free(%d) < mpsiz(%d) !!!" VT_POP, 
					 free, mpsiz);
			otg_fs->diepempmsk &= ~(1 << 0);
			return;
		}
		if (free < xfrsiz) {
			/* Transfer only full packets */
			cnt = (free / mpsiz) * mpsiz;
		} else {
			/* Transfer all */
			cnt = xfrsiz;
		}
	}

	otg_fs->inep[0].diepctl = diepctl | OTG_FS_EPENA | OTG_FS_CNAK; 

	/* push into fifo */
	pos = ep->xfr_cnt;
	cp = (uint8_t *)&(ep->xfr_ptr[pos]);
	for (i = 0; i < cnt; i += 4) {
		uint32_t data;
		data = cp[0] + (cp[1] << 8) + (cp[2] << 16) + (cp[3] << 24);
		otg_fs->dfifo[0].push = data;
		cp += 4;
	}	
	ep->xfr_cnt = pos + cnt;
}

static void __ep0_tx_done(struct stm32f_otg_drv * drv)
{
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	struct stm32f_otg_ep * ep = &drv->ep[0];
	unsigned int rem;

	if (ep->state == EP_WAIT_STATUS_IN) {
		struct usb_request * req = &drv->req;
		void * dummy = NULL;
		/* End of SETUP transaction (OUT Data Phase) */
		if (ep->on_setup(drv->cl, req, dummy) < 0) {
			DCC_LOG(LOG_WARNING, "EP0 [SETUP] IN Dev->Host stall!");
		}
		ep->state = EP_IDLE;
		DCC_LOG(LOG_MSG, "EP0 [IDLE]");
		return;
	}

	rem = ep->xfr_len - ep->xfr_cnt;

	if (rem == 0) {
		otg_fs->diepempmsk &= ~(1 << 0);
		/* Prepare to receive SETUP packets */
		otg_fs->outep[0].doeptsiz = OTG_FS_STUPCNT_SET(3) | 
			OTG_FS_PKTCNT_SET(1) | OTG_FS_XFRSIZ_SET(40);
		/* EP enable */
		otg_fs->outep[0].doepctl |= OTG_FS_EPENA | OTG_FS_CNAK;
		ep->state = EP_IN_DATA;
		DCC_LOG(LOG_MSG, "EP0 [IN_DATA]");
		return;
	} 
	
	DCC_LOG1(LOG_MSG, "EP0 [SETUP] IN Dev->Host (%d)", rem);
	__ep0_tx_setup(otg_fs, rem);
}


static void __ep_tx_done(struct stm32f_otg_drv * drv, int idx)
{
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	int ep_id = idx + OTG_INEP_OFF;
	struct stm32f_otg_ep * ep;
	uint32_t diepctl;

	ep = &drv->ep[ep_id];
	diepctl = otg_fs->inep[idx].diepctl;
	if (ep->state == EP_IN_DATA_ZLP) {
		DCC_LOG4(LOG_INFO, VT_PSH VT_FGR
				 "[%d] [IN_DATA_ZLP] -> [IN_ZLP] EPENA=%d NAKSTS=%d DPID=%d." 
				 VT_POP, idx, 
				 diepctl & OTG_FS_EPENA ? 1 : 0, 
				 diepctl & OTG_FS_NAKSTS ? 1 : 0, 
				 diepctl & OTG_FS_DPID ? 1 : 0);
		otg_fs->inep[idx].dieptsiz = OTG_FS_PKTCNT_SET(1) | 
			OTG_FS_XFRSIZ_SET(0);
		otg_fs->inep[idx].diepctl = diepctl | OTG_FS_EPENA;
		ep->state = EP_IN_ZLP;
		return;
	}

#if DEBUG
	if (ep->state == EP_IN_DATA) {
		DCC_LOG4(LOG_MSG, VT_PSH VT_FGR
				 "[%d] [IN_DATA]->[IDLE] EPENA=%d NAKSTS=%d DPID=%d." 
				 VT_POP, idx, 
				 diepctl & OTG_FS_EPENA ? 1 : 0, 
				 diepctl & OTG_FS_NAKSTS ? 1 : 0, 
				 diepctl & OTG_FS_DPID ? 1 : 0);
	} else if (ep->state == EP_IN_ZLP) {
		DCC_LOG4(LOG_MSG, VT_PSH VT_FGR
				 "[%d] [IN_ZLP]->[IDLE] EPENA=%d NAKSTS=%d DPID=%d." 
				 VT_POP, idx, 
				 diepctl & OTG_FS_EPENA ? 1 : 0, 
				 diepctl & OTG_FS_NAKSTS ? 1 : 0, 
				 diepctl & OTG_FS_DPID ? 1 : 0);
	} else {
		DCC_LOG5(LOG_MSG, VT_PSH VT_FRD
				 "[%d] [state=%d]->[IDLE]  EPENA=%d NAKSTS=%d DPID=%d." 
				 VT_POP, idx, ep->state,
				 diepctl & OTG_FS_EPENA ? 1 : 0, 
				 diepctl & OTG_FS_NAKSTS ? 1 : 0, 
				 diepctl & OTG_FS_DPID ? 1 : 0);
	}
#endif

