bobmittmann/thinkos/arch/stm32/libstm32f/otg_fs/stm32f-otg_fs_dev.c
	ep->state = EP_IDLE;
	/* call class endpoint callback */
	ep->on_in(drv->cl, ep_id);
}

int stm32f_otg_dev_ep_pkt_xmit(struct stm32f_otg_drv * drv, int ep_id,
							   void * buf, unsigned int len)
{
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	struct stm32f_otg_ep * ep;
	uint32_t diepctl;
	uint32_t mpsiz;
	uint32_t xfrsiz;
	uint32_t pktcnt;
	uint32_t free;
	uint8_t * cp;
	unsigned int idx;
	unsigned int i;

	ep = &drv->ep[ep_id];
	idx = ep->idx;

	diepctl = otg_fs->inep[idx].diepctl;
	if (ep->state != EP_IDLE) {
#if DEBUG
		if (ep->state == EP_IN_DATA) {
			DCC_LOG4(LOG_INFO, VT_PSH VT_FMG
					 "[%d] IN_DATA EPENA=%d NAKSTS=%d DPID=%d." 
					 VT_POP, idx, 
					 diepctl & OTG_FS_EPENA ? 1 : 0, 
					 diepctl & OTG_FS_NAKSTS ? 1 : 0, 
					 diepctl & OTG_FS_DPID ? 1 : 0);
		} else if (ep->state == EP_IN_DATA_ZLP) {
			DCC_LOG4(LOG_INFO, VT_PSH VT_FMG
					 "[%d] IN_DATA_ZLP EPENA=%d NAKSTS=%d DPID=%d." 
					 VT_POP, idx, 
					 diepctl & OTG_FS_EPENA ? 1 : 0, 
					 diepctl & OTG_FS_NAKSTS ? 1 : 0, 
					 diepctl & OTG_FS_DPID ? 1 : 0);
		} else if (ep->state == EP_IN_ZLP) {
			DCC_LOG4(LOG_INFO, VT_PSH VT_FMG
					 "[%d] IN_ZLP EPENA=%d NAKSTS=%d DPID=%d." 
					 VT_POP, idx, 
					 diepctl & OTG_FS_EPENA ? 1 : 0, 
					 diepctl & OTG_FS_NAKSTS ? 1 : 0, 
					 diepctl & OTG_FS_DPID ? 1 : 0);
		} else {
			DCC_LOG5(LOG_WARNING, VT_PSH VT_FMG
					 "[%d] state=%d EPENA=%d NAKSTS=%d DPID=%d." 
					 VT_POP, idx, ep->state,
					 diepctl & OTG_FS_EPENA ? 1 : 0, 
					 diepctl & OTG_FS_NAKSTS ? 1 : 0, 
					 diepctl & OTG_FS_DPID ? 1 : 0);
		}
#endif
		return 0;
	}

	mpsiz = OTG_FS_MPSIZ_GET(diepctl);
	free = otg_fs->inep[idx].dtxfsts * 4;
	xfrsiz = MIN(len, free);

	if (xfrsiz > 0) {
		pktcnt = (xfrsiz + (mpsiz - 1)) / mpsiz;
		if (pktcnt > STM32_OTG_FS_BULK_PKTS) {
			pktcnt = STM32_OTG_FS_BULK_PKTS;
			xfrsiz = STM32_OTG_FS_BULK_PKTS * mpsiz;
		} 
	} else {
		/* zero lenght packet */
		pktcnt = 1;
		xfrsiz = 0;
	}

	if ((xfrsiz % mpsiz) == 0) {
		ep->state = EP_IN_DATA_ZLP; /* data + ZLP */
		DCC_LOG3(LOG_INFO, VT_PSH VT_FGR 
				 "[%d] [IDLE]->[IN_DATA_ZLP]! pktcnt=%d xfrsiz=%d" VT_POP,
				 idx, pktcnt, xfrsiz);
	} else {
		ep->state = EP_IN_DATA;
		DCC_LOG3(LOG_INFO, VT_PSH VT_FGR 
				 "[%d] [IDLE]->[IN_DATA] pktcnt=%d xfrsiz=%d" VT_POP, 
				 idx, pktcnt, xfrsiz);
	}

	otg_fs->inep[idx].dieptsiz = OTG_FS_PKTCNT_SET(pktcnt) | 
		OTG_FS_XFRSIZ_SET(xfrsiz); 
	otg_fs->inep[idx].diepctl = diepctl | OTG_FS_EPENA; 

	cp = (uint8_t *)buf;
	for (i = 0; i < xfrsiz; i += 4) {
		uint32_t data;
		data = cp[0] + (cp[1] << 8) + (cp[2] << 16) + (cp[3] << 24);
		otg_fs->dfifo[idx].push = data;
		cp += 4;
	}	

	return xfrsiz;
}

static void __ep0_rx_pop(struct stm32f_otg_drv * drv, int len)
{
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	volatile uint32_t * pop = &otg_fs->dfifo[0].pop;
	struct stm32f_otg_ep * ep = &drv->ep[0];
	uint8_t * dst;
	uint32_t data;
	int wcnt;
	int rem;
	int cnt;
	int i;

	/* Number of words in the receive fifo */
	wcnt = (len + 3) / 4;
	DCC_LOG1(LOG_MSG, "poping %d words from FIFO.", wcnt);

	cnt = ep->xfr_cnt;
	rem = ep->xfr_len - cnt;
	if (rem >= len) {
		/* If we have enough room in the destination buffer
		 * pop data from the fifo and copy to destination buffer */
		dst = &ep->xfr_ptr[cnt];
		for (i = 0; i < wcnt; ++i) {
			data = *pop;
			*dst++ = data;
			*dst++ = data >> 8;
			*dst++ = data >> 16;
			*dst++ = data >> 24;
		}
		ep->xfr_cnt = cnt + len;
	} else {
		DCC_LOG(LOG_WARNING, "not room to copy the whole packet, discarding!");
		for (i = 0; i < wcnt; ++i) {
			data = *pop;
			(void)data;
		}
	}
}

void __ep_out_xfer_comp(struct stm32f_otg_drv * drv, int idx)
{
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	int ep_id = idx;
	struct stm32f_otg_ep * ep = &drv->ep[ep_id];
	uint32_t pktcnt;
	uint32_t xfrsiz;
	uint32_t doepctl;
	uint32_t mpsiz;

	/* Disable SOF interrupts */
	//				otg_fs->gintmsk &= ~OTG_FS_SOFM;
	doepctl = otg_fs->outep[idx].doepctl;
	mpsiz = OTG_FS_MPSIZ_GET(doepctl);
	xfrsiz = ep->xfr_max;
	pktcnt = xfrsiz / mpsiz;

	DCC_LOG3(LOG_MSG, VT_PSH VT_FYW 
			 "OTG_EPENA=%d pktcnt=%d xfrsiz=%d" VT_POP,
			 (doepctl & OTG_FS_EPENA) ? 1 : 0, pktcnt, xfrsiz);

	/* Prepare EP_OUT to receive */
	otg_fs->outep[idx].doeptsiz = OTG_FS_PKTCNT_SET(pktcnt) |
		OTG_FS_XFRSIZ_SET(xfrsiz);

	/* 5. After the data payload is popped from the receive FIFO, the 
	   RXFLVL interrupt (OTG_FS_GINTSTS) must be unmasked. */
	doepctl |= OTG_FS_EPENA | OTG_FS_CNAK; 
	/* Clear NAK, prepare to receive  ... */
	otg_fs->outep[idx].doepctl = doepctl;
}

int stm32f_otg_dev_ep_pkt_recv(struct stm32f_otg_drv * drv, int ep_id,
							   void * buf, int len)
{
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	uint8_t * cp = (uint8_t *)buf;
	struct stm32f_otg_ep * ep;
	uint32_t data;
	uint32_t doeptsiz;
	uint32_t pktcnt;
	uint32_t xfrsiz;
	uint32_t doepctl;
	int idx;
	int cnt;
	int rem;
	int n;

#if DEBUG
	if ((unsigned int)ep_id >= OTG_EP_MAX) {
		DCC_LOG1(LOG_WARNING, "invalid ep_id=%d!", ep_id);
		return -1;
	}
#endif

	DCC_LOG2(LOG_MSG, "ep_id=%d len=%d", ep_id, len);
	ep = &drv->ep[ep_id];
	idx = ep->idx;
	
	/* transfer data from fifo */
	rem = ep->xfr_len - ep->xfr_cnt;
	cnt = MIN(len, rem);
	if (cnt == 0)
		return 0;

	doepctl = otg_fs->outep[idx].doepctl;
	doeptsiz = otg_fs->outep[idx].doeptsiz;
	pktcnt = OTG_FS_PKTCNT_GET(doeptsiz);
	(void)pktcnt;
	xfrsiz = OTG_FS_XFRSIZ_GET(doeptsiz);
	(void)xfrsiz;

	if ((n = ep->xfr_cnt & 0x003) > 0) {
		n = 4 - n;
		n = MIN(n, cnt);

		data = ep->xfr_dat;
		switch (n) {
			case 3:
				*cp++ = data;
				data >>= 8;
				/* FALLTHROUGH */
			case 2:
				*cp++ = data;
				data >>= 8;
				/* FALLTHROUGH */
			case 1:
				*cp++ = data;
				data >>= 8;
		}
		ep->xfr_dat = data;
	}

	if (doepctl & OTG_FS_EPENA) {
		n = cnt - n;
		while (n >= 4) {
			/* word by word trasfer */
			data = otg_fs->dfifo[idx].pop;
			cp[0] = data;
			cp[1] = data >> 8;
			cp[2] = data >> 16;
			cp[3] = data >> 24;
			cp += 4;
			n -= 4;
		}

		if (n > 0) {
			/* remaining data */
			data = otg_fs->dfifo[idx].pop;
			switch (n) {
			case 3:
				*cp++ = data;
				data >>= 8;
				/* FALLTHROUGH */
			case 2:
				*cp++ = data;
				data >>= 8;
				/* FALLTHROUGH */
			case 1:
				*cp++ = data;
				data >>= 8;
			}
			ep->xfr_dat = data;
		}

	
	} else {
		DCC_LOG3(LOG_ERROR, VT_PSH VT_FRD VT_UND VT_BRI
				 "OTG_EPENA=%d pktcnt=%d xfrsiz=%d" VT_POP,
				 (doepctl & OTG_FS_EPENA) ? 1 : 0, pktcnt, xfrsiz);
	}


	ep->xfr_cnt += cnt;

	rem -= cnt;

	if (((ep->xfr_len + 3) & ~0x3) == ((ep->xfr_cnt + 3) & ~0x3)) {
		/* 5. After the data payload is popped from the receive FIFO, the 
		   RXFLVL interrupt (OTG_FS_GINTSTS) must be unmasked. */
		DCC_LOG(LOG_INFO, VT_PSH VT_FYW VT_REV " FIFO IRQ enabled " VT_POP);
		/* Reenable RX fifo interrupts */
		otg_fs->gintmsk |= OTG_FS_RXFLVLM;
		/* FIXME: implement timeout... */
	}

	return cnt;
}

