bobmittmann/thinkos/arch/stm32/libstm32f/otg_fs/stm32f-otg_fs_dev.c
int stm32f_otg_dev_ep_ctl(struct stm32f_otg_drv * drv, 
						  unsigned int ep_id, unsigned int opt)
{
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	struct stm32f_otg_ep * ep= &drv->ep[ep_id];
	int idx;

#if DEBUG
	if ((unsigned int)ep_id >= OTG_EP_MAX) {
		DCC_LOG1(LOG_WARNING, "invalid ep_id=%d!", ep_id);
		return -1;
	}
#endif

	ep= &drv->ep[ep_id];
	idx = ep->idx;

#if DEBUG
	if ((unsigned int)ep_id >= OTG_EP_MAX) {
		DCC_LOG(LOG_WARNING, "invalid EP");
		return -1;
	}
#endif

	DCC_LOG2(LOG_MSG, "ep=%d opt=%d", ep_id, opt);
	ep = &drv->ep[ep_id];

#if DEBUG
	if (idx != ep->idx) {
		DCC_LOG(LOG_WARNING, "unconfigured EP!!!!");
		return -1;
	}
#endif

	switch (opt) {
	case USB_EP_RECV_OK:
		break;

	case USB_EP_NAK_CLR:
		/* Clear NAK, prepare to receive  ... */
		otg_fs->outep[idx].doepctl |= OTG_FS_CNAK;
		break;

	case USB_EP_NAK_SET:
		otg_fs->outep[idx].doepctl |= OTG_FS_SNAK;
		break;

	case USB_EP_ZLP_SEND:
		__ep_zlp_send(otg_fs, idx);
		break;

	case USB_EP_STALL_SET:
		if (idx >= OTG_INEP_OFF)
			__ep_in_stall_set(otg_fs, idx);
		else
			__ep_out_stall_set(otg_fs, idx);
		DCC_LOG1(LOG_MSG, "[%d] [STALLED]", idx);
		ep->state = EP_STALLED;
		break;

	case USB_EP_STALL_CLR:
		if (idx >= OTG_INEP_OFF)
			__ep_in_stall_clr(otg_fs, idx);
		else
			__ep_out_stall_clr(otg_fs, idx);
		DCC_LOG1(LOG_MSG, "[%d] [IDLE]", idx);
		ep->state = EP_IDLE;
		break;

	case USB_EP_DISABLE:
		ep->state = EP_UNCONFIGURED;
		break;

	case USB_EP_IN_REQ:
		if (ep->state == EP_STALLED) {
			DCC_LOG(LOG_TRACE, "EP IN REQ - STALLED");
		} else if (ep->state == EP_UNCONFIGURED) {
			DCC_LOG(LOG_TRACE, "EP IN REQ - UNCONFIGURED");
		} else if (ep->state == EP_IDLE) {
			DCC_LOG(LOG_TRACE, "EP IN REQ - EP_IDLE");
		} else {
			DCC_LOG(LOG_TRACE, "EP IN REQ");
		}
		break;


	default:
		return -1;
	}

	return 0;
}

int stm32f_otg_dev_ep_init(struct stm32f_otg_drv * drv, 
						   const usb_dev_ep_info_t * info, 
						   void * xfr_buf, int buf_len)
{
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	struct stm32f_otg_ep * ep;
	int mxpktsz = info->mxpktsz;
	int ep_id;
	int idx;

	if ((idx = info->addr & 0x7f) > 3) {
		DCC_LOG1(LOG_ERROR, "invalid address addr=%d", info->addr);
		return -1;
	}

	if (info->addr & USB_ENDPOINT_IN) {
		ep_id = idx + OTG_INEP_OFF;
		DCC_LOG(LOG_INFO, "IN ENDPOINT");
	} else {
		ep_id = idx;
		DCC_LOG(LOG_INFO, "OUT ENDPOINT");
	}

	ep = &drv->ep[ep_id];
	ep->xfr_buf = (uint8_t *)xfr_buf;
	ep->xfr_len = 0;
	ep->xfr_cnt = 0;
	ep->state = EP_IDLE;
	ep->on_ev = info->on_ev;
	ep->idx = idx;

	DCC_LOG5(LOG_INFO, "%s ep_id=%d addr=%d idx=%d mxpktsz=%d", 
			 (info->addr & USB_ENDPOINT_IN) ? "IN" : "OUT",
			 ep_id, info->addr & 0x7f, idx, mxpktsz);

	/* mask FIFO empty interrupt */
	otg_fs->diepempmsk &= ~(1 << idx);

	if (ep_id == 0) {
		ep->xfr_max = mxpktsz;

		/*
		if (ep->xfr_max > buf_len) {
			DCC_LOG(LOG_ERROR, "transfer to large to fit in the buffer!");
		} */

		/* Initialize EP0 */
		otg_fs->inep[0].diepctl = OTG_FS_TXFNUM_SET(0) |
			OTG_FS_EP0_MPSIZ_SET(mxpktsz);

		/* 3. Set up the Data FIFO RAM for each of the FIFOs
		   - Program the OTG_FS_GRXFSIZ register, to be able to receive
		   control OUT data and setup data. If thresholding is not enabled,
		   at a minimum, this must be equal to 1 max packet size of
		   control endpoint 0 + 2 Words (for the status of the control OUT
		   data packet) + 10 Words (for setup packets).
		   - Program the OTG_FS_TX0FSIZ register (depending on the FIFO number
		   chosen) to be able to transmit control IN data. At a minimum, this
		   must be equal to 1 max packet size of control endpoint 0. */

		__ep_pktbuf_alloc(drv, 0, ep->xfr_max);

		/*  4. Program the following fields in the endpoint-specific registers
			for control OUT endpoint 0 to receive a SETUP packet
			- STUPCNT = 3 in OTG_FS_DOEPTSIZ0 (to receive up to 3 back-to-back
			SETUP packets)
			At this point, all initialization required to receive SETUP packets
			is done. */

		/* Prepare to receive */
		otg_fs->outep[0].doeptsiz = OTG_FS_STUPCNT_SET(3) | 
			OTG_FS_PKTCNT_SET(1) | OTG_FS_XFRSIZ_SET(40);
		/* EP enable */
		otg_fs->outep[0].doepctl |= OTG_FS_EPENA | OTG_FS_CNAK;

		/* Unmask EP0 interrupts */
		otg_fs->daintmsk = OTG_FS_IEPM0 | OTG_FS_OEPM0;

		DCC_LOG2(LOG_MSG, "TX[0]: addr=%04x size=%d",
				 OTG_FS_TX0FSA_GET(otg_fs->dieptxf0) * 4,
				 OTG_FS_TX0FD_GET(otg_fs->dieptxf0) * 4);
	} else {
		uint32_t depctl;

		if (info->addr & USB_ENDPOINT_IN) {
			if ((info->attr & 0x03) == ENDPOINT_TYPE_BULK) {
				ep->xfr_max = STM32_OTG_FS_BULK_PKTS * mxpktsz;
			} else {
				ep->xfr_max = mxpktsz;
			}
			__ep_pktbuf_alloc(drv, idx, ep->xfr_max);
		} else {
			ep->xfr_max = mxpktsz;
		}

		depctl = OTG_FS_MPSIZ_SET(mxpktsz);
		depctl |= OTG_FS_SD0PID | OTG_FS_USBAEP;

		switch (info->attr & 0x03) {
		case ENDPOINT_TYPE_CONTROL:
			DCC_LOG(LOG_MSG, "ENDPOINT_TYPE_CONTROL");
			depctl |= OTG_FS_EPTYP_SET(OTG_FS_EPTYP_CTRL);
			break;

		case ENDPOINT_TYPE_ISOCHRONOUS:
			DCC_LOG(LOG_MSG, "ENDPOINT_TYPE_ISOCHRONOUS");
			depctl |= OTG_FS_EPTYP_SET(OTG_FS_EPTYP_ISOC);
			break;

		case ENDPOINT_TYPE_BULK:
			DCC_LOG(LOG_MSG, "ENDPOINT_TYPE_BULK");
			depctl |= OTG_FS_EPTYP_SET(OTG_FS_EPTYP_BULK);
			break;

		case ENDPOINT_TYPE_INTERRUPT:
			DCC_LOG(LOG_MSG, "ENDPOINT_TYPE_INTERRUPT");
			depctl |= OTG_FS_EPTYP_SET(OTG_FS_EPTYP_INT);
			break;
		}

		if (info->addr & USB_ENDPOINT_IN) {
			/* Set TX fifo number */
			depctl |= OTG_FS_TXFNUM_SET(idx);
			otg_fs->inep[idx].dieptsiz = 0;
			/* Activate IN endpoint */
			otg_fs->inep[idx].diepctl = depctl;
			/* Enable endpoint interrupt */
			otg_fs->daintmsk |= OTG_FS_IEPM(idx);

		} else {
			uint32_t xfrsiz;
			uint32_t pktcnt;

			/* get the size of the RX fifio */
			xfrsiz = ep->xfr_max;
			pktcnt = xfrsiz / mxpktsz;

			DCC_LOG3(LOG_MSG, VT_PSH VT_FYW 
					 "OTG_EPENA=%d pktcnt=%d xfrsiz=%d" VT_POP,
					 (depctl & OTG_FS_EPENA) ? 1 : 0, pktcnt, xfrsiz);

			otg_fs->outep[idx].doepctl = depctl | OTG_FS_SNAK;

			/* Prepare EP_OUT to receive */
			otg_fs->outep[idx].doeptsiz = OTG_FS_PKTCNT_SET(pktcnt) |
				OTG_FS_XFRSIZ_SET(xfrsiz);

