bobmittmann/thinkos/arch/stm32/libstm32f/otg_fs/stm32f-otg_fs_dev.c
			/* EP enable */
			/* FIXME: the single input fifo creates a problem as 
			   packets pending on the fifo for one endpoint blocks packets for 
			   other  endpoints. */
			/* Clear NAK, prepare to receive  ... */
			otg_fs->outep[idx].doepctl = depctl | OTG_FS_EPENA | OTG_FS_CNAK;

			/* Enable endpoint interrupt */
			otg_fs->daintmsk |= OTG_FS_OEPM(idx);
		}

	}

	/* 2. Once the endpoint is activated, the core starts decoding the
	   tokens addressed to that endpoint and sends out a valid
	   handshake for each valid token received for the
	   endpoint. */

	return ep_id;
}

#define OTG_FS_DP   STM32_GPIOA, 12
#define OTG_FS_DM   STM32_GPIOA, 11
#define OTG_FS_ID   STM32_GPIOA, 10

#ifdef STM32_OTG_FS_VBUS 
#define OTG_FS_VBUS STM32_OTG_FS_VBUS
#else
#define OTG_FS_VBUS STM32_GPIOA, 9
#endif

static inline struct stm32_gpio * vbus_gpio(struct stm32_gpio *__gpio, 
											int __pin) {
	return __gpio;
}

static void otg_io_init(void)
{
#if STM32_OTG_FS_IO_INIT
	DCC_LOG(LOG_MSG, "Configuring GPIO pins...");

	stm32_clk_enable(STM32_RCC, STM32_CLK_GPIOA);

	stm32_gpio_af(OTG_FS_DP, GPIO_AF10);
	stm32_gpio_af(OTG_FS_DM, GPIO_AF10);
	stm32_gpio_mode(OTG_FS_DP, ALT_FUNC, PUSH_PULL | SPEED_HIGH);
	stm32_gpio_mode(OTG_FS_DM, ALT_FUNC, PUSH_PULL | SPEED_HIGH);

#if STM32_OTG_FS_VBUS_CONNECT
	DCC_LOG(LOG_MSG, "Configuring VBUS GPIO ...");
	if (vbus_gpio(OTG_FS_VBUS) == STM32_GPIOB)
		stm32_clk_enable(STM32_RCC, STM32_CLK_GPIOB);

	stm32_gpio_af(OTG_FS_VBUS, GPIO_AF10);
	stm32_gpio_mode(OTG_FS_VBUS, ALT_FUNC, SPEED_LOW);
#endif

#if 0
	stm32_gpio_af(OTG_FS_ID, GPIO_AF10);
	stm32_gpio_mode(OTG_FS_ID, ALT_FUNC, PUSH_PULL | SPEED_HIGH);
#endif

#endif
}

#if STM32_OTG_FS_VBUS_CONNECT
static void otg_vbus_connect(bool connect)
{
	if (connect)
		stm32_gpio_mode(OTG_FS_VBUS, ALT_FUNC, SPEED_LOW);
	else
		stm32_gpio_mode(OTG_FS_VBUS, INPUT, 0);
}
#endif

static void otg_connect(struct stm32f_otg_fs * otg_fs)
{
#if STM32_OTG_FS_VBUS_CONNECT
	otg_vbus_connect(true);
#endif
	/* Connect device */
	otg_fs->dctl &= ~OTG_FS_SDIS;
	udelay(3000);
}

static void otg_disconnect(struct stm32f_otg_fs * otg_fs)
{
#if STM32_OTG_FS_VBUS_CONNECT
	otg_vbus_connect(false);
#endif
	otg_fs->dctl |= OTG_FS_SDIS;
	udelay(3000);

}

void stm32_otg_power_on(struct stm32f_otg_fs * otg_fs)
{
	DCC_LOG(LOG_MSG, "Enabling USB FS clock...");
	stm32_clk_enable(STM32_RCC, STM32_CLK_OTGFS);

	otg_connect(otg_fs);

	DCC_LOG(LOG_MSG, "[ATTACHED]");

	/* Enable Cortex interrupt */
#if STM32_OTG_FS_IRQ_ENABLE
	cm3_irq_enable(STM32F_IRQ_OTG_FS);
#endif
}

void stm32_otg_power_off(struct stm32f_otg_fs * otg_fs)
{
	otg_disconnect(otg_fs);

	DCC_LOG(LOG_MSG, "Disabling USB device clock...");
	stm32_clk_disable(STM32_RCC, STM32_CLK_OTGFS);
}

int stm32f_otg_fs_dev_init(struct stm32f_otg_drv * drv, 
						   struct usb_class_if * cif,
						   const struct usb_class_events * ev)
{
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	int i;

	drv->cl = cif;
	drv->ev = ev;

	for (i = 0; i < OTG_EP_MAX; ++i) 
		drv->ep[i].state = EP_UNCONFIGURED;

	/* Initialize IO pins */
	otg_io_init();

	DCC_LOG(LOG_INFO, "Enabling USB FS clock...");
	stm32_clk_enable(STM32_RCC, STM32_CLK_OTGFS);
	
	/* Initialize as a device */
	stm32f_otg_fs_device_init(otg_fs);

	/* 2. Program the OTG_FS_GINTMSK register to unmask the 
	   following interrupts:
	   â€“ Wakeup 
	   â€“ USB reset
	   â€“ Enumeration done
	   â€“ Early suspend
	   â€“ USB suspend
	   â€“ SOF */
#if DEBUG
	otg_fs->gintmsk = 
		OTG_FS_WUIM |
		OTG_FS_SRQIM |
		OTG_FS_DISCINT |
		OTG_FS_CIDSCHGM |
		OTG_FS_LPMINTM |
		OTG_FS_RSTDETM |
		OTG_FS_IISOOXFRM |
		OTG_FS_IISOIXFRM |
		OTG_FS_OEPINTM |
		OTG_FS_IEPINTM |
		OTG_FS_EPMISM |
		OTG_FS_EOPFM |
		OTG_FS_ISOODRPM |
		OTG_FS_USBRSTM |
		OTG_FS_ENUMDNEM |
		OTG_FS_USBSUSPM |
		OTG_FS_ESUSPM |
		OTG_FS_GONAKEFFM |
		OTG_FS_GINAKEFFM |
		OTG_FS_NPTXFEM |
		OTG_FS_RXFLVLM |
		OTG_FS_SOFM |
		OTG_FS_OTGINT |
		OTG_FS_MMISM;
#else
	otg_fs->gintmsk = OTG_FS_WUIM | OTG_FS_USBRSTM | OTG_FS_ENUMDNEM | 
		OTG_FS_ESUSPM | OTG_FS_USBSUSPM;
#endif

#ifdef STM32F446X
	otg_connect(otg_fs);
#endif

	/* Enable Cortex interrupt */
#if STM32_OTG_FS_IRQ_ENABLE
	cm3_irq_enable(STM32F_IRQ_OTG_FS);
#endif

	DCC_LOG(LOG_MSG, "done ----------------------------------------");

	return 0;
}

/* 
 *  ---------------------------------------------------------------------------
 * Interrupt handling
 * ---------------------------------------------------------------------------
 */

static void stm32f_otg_dev_ep_out(struct stm32f_otg_drv * drv, 
								  int idx, int len)
{
	struct stm32f_otg_ep * ep = &drv->ep[idx];
//	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	int ep_id = idx;

	DCC_LOG1(LOG_MSG, "ep_id=%d", ep_id);

	ep->xfr_len = len;
	ep->xfr_cnt = 0;

	/* FIXME: the single input fifo creates a problem as 
	   packets pending on the fifo for one endpoint blocks packets for 
	   other  endpoints. Ex: an outstanding OUT packet may block a control
	   packet. Either the upper layer garantees the removal or
	   buffering at this layer should be implemented.
	 */
	/* XXX: set the nak on endpoint ???? */
//	otg_fs->outep[idx].doepctl |= OTG_FS_SNAK;

	/* call class endpoint callback */
	ep->on_out(drv->cl, ep_id, len);
}

static void stm32f_otg_dev_ep0_out(struct stm32f_otg_drv * drv)
{
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	struct stm32f_otg_ep * ep = &drv->ep[0];

	/* last and only transfer */
	if (ep->state == EP_OUT_DATA_LAST) {
		ep->state = EP_WAIT_STATUS_IN;
		DCC_LOG(LOG_MSG, "EP0 [WAIT_STATUS_IN]");
		__ep_zlp_send(otg_fs, 0);
		return;
	} 

	if (ep->state == EP_WAIT_STATUS_IN) {
		DCC_LOG(LOG_WARNING, "ep->state != EP_WAIT_STATUS_IN!");
	}
}

static void stm32f_otg_dev_ep0_setup(struct stm32f_otg_drv * drv)
{
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	struct usb_request * req = &drv->req;
	struct stm32f_otg_ep * ep = &drv->ep[0];
	int len;

	DCC_LOG3(LOG_MSG, "type=0x%02x request=0x%02x len=%d ",
			req->type, req->request, req->length);

	/* No-Data control SETUP transaction */
	if (req->length == 0) {
		void * dummy = NULL;

		ep->xfr_ptr = ep->xfr_buf;
		ep->xfr_len = 0;
		ep->xfr_cnt = 0;

