bobmittmann/thinkos/arch/stm32/libstm32f/otg_fs/stm32f-otg_fs_dev.c
		DCC_LOG(LOG_INFO, "EP0 [SETUP] Host->Dev len=0");
		if (((req->request << 8) | req->type) == STD_SET_ADDRESS) {
			DCC_LOG1(LOG_MSG, "address=%d",  req->value);
			stm32f_otg_fs_addr_set(otg_fs, req->value);
		}

		ep->on_setup(drv->cl, req, dummy);
		__ep_zlp_send(otg_fs, 0);
		ep->state = EP_IDLE;
		DCC_LOG(LOG_INFO, "EP0 [IDLE]");

		return;
	}

	if (req->type & 0x80) {
		/* Control Read SETUP transaction (IN Data Phase) */
		DCC_LOG1(LOG_INFO, "EP0 [SETUP] IN Dev->Host (%d)", req->length);
		ep->xfr_ptr = NULL;
		len = ep->on_setup(drv->cl, req, (void *)&ep->xfr_ptr);
		ep->xfr_len = MIN(req->length, len);
		ep->xfr_cnt = 0;
		/* prepare fifo to transmit */
		__ep0_tx_setup(otg_fs, ep->xfr_len);
	} else {
		/* Control Write SETUP transaction (OUT Data Phase) */
		ep->xfr_ptr = ep->xfr_buf;
		ep->xfr_len = req->length;
		ep->xfr_cnt = 0;

		DCC_LOG1(LOG_INFO, "EP0 [SETUP] OUT Host->Dev (%d)", req->length);

		if (ep->xfr_len < ep->xfr_max) {
			/* last and only transfer */
			ep->state = EP_OUT_DATA_LAST;
			DCC_LOG(LOG_INFO, "EP0 [OUT_DATA_LAST] OUT Host->Dev!!!!");
		} else {
			ep->state = EP_OUT_DATA;
			DCC_LOG(LOG_INFO, "EP0 [OUT_DATA] OUT Host->Dev!!!!");
		}

		DCC_LOG(LOG_MSG, "Prepare to receive");

		/* Prepare to receive DATA */
		otg_fs->outep[0].doeptsiz = OTG_FS_STUPCNT_SET(0) |
			OTG_FS_PKTCNT_SET(1) | OTG_FS_XFRSIZ_SET(ep->xfr_max);
		/* EP enable */
		otg_fs->outep[0].doepctl |= OTG_FS_EPENA | OTG_FS_CNAK;
	}
}

static void stm32f_otg_dev_reset(struct stm32f_otg_drv * drv)
{
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	uint32_t siz;
	int i;

	DCC_LOG(LOG_INFO, "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");

	/* Clear the Remote Wake-up Signaling */
	otg_fs->dctl &= ~OTG_FS_RWUSIG;

	/* Clear all pending interrupts */
	otg_fs->diepmsk = 0;
	otg_fs->doepmsk = 0;
	otg_fs->daint = 0xffffffff;
	otg_fs->daintmsk = 0;
	otg_fs->diepempmsk = 0;

	for (i = 0; i < 4; i++) {
		otg_fs->inep[i].diepint = 0xff;
		otg_fs->outep[i].doepint = 0xff;
		otg_fs->inep[i].dieptsiz = 0;
	}

	for (i = 0; i < OTG_EP_MAX; i++) {
		drv->ep[i].xfr_len = 0;
		drv->ep[i].xfr_cnt = 0;
		drv->ep[i].state = EP_UNCONFIGURED;
	}

	/* Flush the Tx FIFO */
	stm32f_otg_fs_txfifo_flush(otg_fs, TXFIFO_ALL);
	/* Flush the Rx FIFO */
	stm32f_otg_fs_rxfifo_flush(otg_fs);

	/* Reset global interrupts mask */
	otg_fs->gintmsk =  OTG_FS_WUIM |
			OTG_FS_USBRSTM | OTG_FS_ENUMDNEM |
			OTG_FS_ESUSPM | OTG_FS_USBSUSPM;
	//	OTG_FS_SRQIM | OTG_FS_OTGINT;

	/* Reset Device Address */
	otg_fs->dcfg &= ~OTG_FS_DAD_MSK;

	/*  Set global IN NAK */
	otg_fs->dctl |= OTG_FS_SGINAK;

	/* Endpoint initialization on USB reset */

	/* 1. Set the NAK bit for all OUT endpoints
	   – SNAK = 1 in OTG_FS_DOEPCTLx (for all OUT endpoints) */
	for (i = 0; i < OTG_OUTEP_MAX; i++) {
		otg_fs->outep[i].doepctl = OTG_FS_SNAK;
	}

	/* 2. Unmask the following interrupt bits
	   - INEP0 = 1 in OTG_FS_DAINTMSK (control 0 IN endpoint)
	   - OUTEP0 = 1 in OTG_FS_DAINTMSK (control 0 OUT endpoint)
	   - STUP = 1 in DOEPMSK
	   - XFRC = 1 in DOEPMSK
	   - XFRC = 1 in DIEPMSK
	   - TOC = 1 in DIEPMSK */
	otg_fs->doepmsk = OTG_FS_STUPM | OTG_FS_XFRCM | OTG_FS_EPDM;
	otg_fs->diepmsk = OTG_FS_TOM | OTG_FS_EPDM | OTG_FS_XFRCM;
//		OTG_FS_ITTXFEMSK;

	/* 3. Set up the Data FIFO RAM for each of the FIFOs
	   - Program the OTG_FS_GRXFSIZ register, to be able to receive
	   control OUT data and setup data. If thresholding is not enabled,
	   at a minimum, this must be equal to 1 max packet size of
	   control endpoint 0 + 2 Words (for the status of the control OUT
	   data packet) + 10 Words (for setup packets).
	   - Program the OTG_FS_TX0FSIZ register (depending on the FIFO number
	   chosen) to be able to transmit control IN data. At a minimum, this
	   must be equal to 1 max packet size of control endpoint 0. */

	/* reset fifo memory (packet buffer) allocation pointer */
	drv->fifo_addr = 0;
	/* initialize RX fifo size */
	siz = STM32_OTG_FS_RX_FIFO_SIZE;
	otg_fs->grxfsiz = siz / 4;
	/* update fifo memory allocation pointer */
	drv->fifo_addr += siz;

	DCC_LOG2(LOG_MSG, "   RX: addr=%04x size=%d",
			 0, otg_fs->grxfsiz * 4);

	drv->ev->on_reset(drv->cl);
}

/* Private USB device driver data */
struct stm32f_otg_drv stm32f_otg_fs_drv0;

void stm32f_otg_fs_isr(void)
{
	struct stm32f_otg_drv * drv = &stm32f_otg_fs_drv0;
	struct stm32f_otg_fs * otg_fs = STM32F_OTG_FS;
	uint32_t gintsts;
	uint32_t ep_intr;


	gintsts = otg_fs->gintsts & otg_fs->gintmsk;

#if DEBUG
	DCC_LOG1(LOG_MSG, "GINTSTS=0x%08x", gintsts);
#endif

	/* IN endpoints interrupts 
	 * ----------------------------------------------------------- 
	 */
	if (gintsts & OTG_FS_IEPINT) {
		uint32_t diepmsk;
		uint32_t diepint;
		uint32_t diepempmsk;
		uint32_t msk;

		DCC_LOG(LOG_JABBER, "<IEPINT>");

		ep_intr = (otg_fs->daint & otg_fs->daintmsk);
		diepmsk = otg_fs->diepmsk;
		diepempmsk = otg_fs->diepempmsk;

		if (ep_intr & OTG_FS_IEPINT0) {
			/* add the Transmit FIFO empty bit to the mask */
			msk = diepmsk | ((diepempmsk >> 0) & 0x1) << 7;
			diepint = otg_fs->inep[0].diepint & msk;
			if (diepint & OTG_FS_TXFE) {
				DCC_LOG(LOG_MSG, "[0] <IEPINT> <TXFE>");
				__ep0_tx_push(drv);
			}
			if (diepint & OTG_FS_XFRC) {
				DCC_LOG(LOG_MSG, "[0] <IEPINT> <XFRC>");
				__ep0_tx_done(drv);
			} 
			if (diepint & OTG_FS_TOC) {
				/* Bit 3 - Timeout condition */
				DCC_LOG(LOG_WARNING, "[0] <IEPINT> <OTG_FS_TOC>");
			} 
			/* clear interrupts */
			otg_fs->inep[0].diepint = diepint;
		}

#if (OTG_INEP_MAX > 0)
		if (ep_intr & OTG_FS_IEPINT1) {
			diepint = otg_fs->inep[1].diepint;
#if 0
			/* add the Transmit FIFO empty bit to the mask */
			msk = diepmsk | ((diepempmsk >> 1) & 0x1) << 7;
			if (diepint & OTG_FS_TXFE) {
				DCC_LOG(LOG_MSG, "[1] <IEPINT> <TXFE>");
			}
#endif
			
			if (diepint & OTG_FS_XFRC) {
				DCC_LOG(LOG_MSG, VT_PSH VT_FGR
						"[1] <IEPINT> <IN XFRC>" VT_POP);
				__ep_tx_done(drv, 1);
			} 
			if (diepint & OTG_FS_TOC) {
				/* Bit 3 - Timeout condition */
				DCC_LOG(LOG_WARNING, VT_PSH VT_FGR
						"[1] <IEPINT> <OTG_FS_TOC>" VT_POP);
			} 
			/* clear interrupts */
			otg_fs->inep[1].diepint = diepint;
		}
#endif

