bobmittmann/thinkos/arch/stm32/libstm32f/otg_fs/stm32f-otg_fs_dev.c
#if (OTG_INEP_MAX > 1)
		if (ep_intr & OTG_FS_IEPINT2) {
			diepint = otg_fs->inep[2].diepint;
#if 0
			/* add the Transmit FIFO empty bit to the mask */
			msk = diepmsk | ((diepempmsk >> 2) & 0x1) << 7;
			diepint = otg_fs->inep[2].diepint & msk;
			if (diepint & OTG_FS_TXFE) {
				DCC_LOG(LOG_MSG, "[2] <IEPINT> <TXFE>");
			}
#endif
			if (diepint & OTG_FS_XFRC) {
				DCC_LOG(LOG_MSG, "[2] <IEPINT> <XFRC>");
				__ep_tx_done(drv, 2);
			}

			if (diepint & OTG_FS_TOC) {
				/* Bit 3 - Timeout condition */
				DCC_LOG(LOG_WARNING, "[2] <IEPINT> <OTG_FS_TOC>");
			} 
			otg_fs->inep[2].diepint = diepint;
		}
#endif

#if (OTG_INEP_MAX > 2)
		if (ep_intr & OTG_FS_IEPINT3) {
			diepint = otg_fs->inep[3].diepint;
#if 0
			/* add the Transmit FIFO empty bit to the mask */
			msk = diepmsk | ((diepempmsk >> 3) & 0x1) << 7;
			if (diepint & OTG_FS_TXFE) {
				DCC_LOG(LOG_MSG, "[3] <IEPINT> <TXFE>");
			}
#endif
			if (diepint & OTG_FS_XFRC) {
				DCC_LOG(LOG_MSG, "[3] <IEPINT> <XFRC>");
				__ep_tx_done(drv, 3);
			}
			if (diepint & OTG_FS_TOC) {
				/* Bit 3 - Timeout condition */
				DCC_LOG(LOG_WARNING, "[3] <IEPINT> <OTG_FS_TOC>");
			} 
			otg_fs->inep[3].diepint = diepint;
		}
#endif
	}

	/* OUT endpoints interrupts 
	 * ----------------------------------------------------------- 
	 */

	if (gintsts & OTG_FS_OEPINT) {
		uint32_t doepmsk;

		ep_intr = (otg_fs->daint & otg_fs->daintmsk);
		doepmsk = otg_fs->doepmsk;

		DCC_LOG(LOG_JABBER, "<OEPINT>");

		if (ep_intr & OTG_FS_OEPINT0) {
			uint32_t doepint;

			doepint = otg_fs->outep[0].doepint & doepmsk;
			if (doepint & OTG_FS_XFRC) {
				DCC_LOG(LOG_INFO, VT_PSH VT_FYW 
						"[0] <OEPINT> <OUT_XFRC>" VT_POP);
				stm32f_otg_dev_ep0_out(drv);
			}
			if (doepint & OTG_FS_EPDISD) {
				DCC_LOG(LOG_JABBER, "[0] <OEPINT> <EPDISD>");
			}
			if (doepint & OTG_FS_STUP) {
				DCC_LOG(LOG_INFO, VT_PSH VT_FYW "[0] <OEPINT> <STUP>" VT_POP);
				stm32f_otg_dev_ep0_setup(drv);
			}
			/* clear interrupts */
			otg_fs->outep[0].doepint = doepint;

		}
#if 1
#if (OTG_OUTEP_MAX > 0)
		if (ep_intr & OTG_FS_OEPINT1) {
			uint32_t doepint;

			doepint = otg_fs->outep[1].doepint & doepmsk;
			if (doepint & OTG_FS_XFRC) {
				DCC_LOG(LOG_INFO, "[1] <OEPINT> <OUT_XFRC>");
			}
			if (doepint & OTG_FS_EPDISD) {
				DCC_LOG(LOG_INFO, "[1] <OEPINT> <EPDISD>");
			}
			if (doepint & OTG_FS_STUP) {
				DCC_LOG(LOG_INFO, "[1] <OEPINT> <STUP>");
			}
			/* clear interrupts */
			otg_fs->outep[1].doepint = doepint;
		}
#endif 

#if (OTG_OUTEP_MAX > 1)
		if (ep_intr & OTG_FS_OEPINT2) {
			uint32_t doepint;

			doepint = otg_fs->outep[2].doepint & doepmsk;
			if (doepint & OTG_FS_XFRC) {
				DCC_LOG(LOG_MSG, "[2] <OEPINT> <OUT_XFRC>");
			}
			if (doepint & OTG_FS_EPDISD) {
				DCC_LOG(LOG_MSG, "[2] <OEPINT> <EPDISD>");
			}
			if (doepint & OTG_FS_STUP) {
				DCC_LOG(LOG_MSG, "[2] <OEPINT> <STUP>");
			}
			/* clear interrupts */
			otg_fs->outep[2].doepint = doepint;
		}
#endif 

#if (OTG_OUTEP_MAX > 2)
		if (ep_intr & OTG_FS_OEPINT3) {
			uint32_t doepint;

			doepint = otg_fs->outep[3].doepint & doepmsk;
			if (doepint & OTG_FS_XFRC) {
				DCC_LOG(LOG_MSG, "[3] <OEPINT> <OUT_XFRC>");
			}
			if (doepint & OTG_FS_EPDISD) {
				DCC_LOG(LOG_MSG, "[3] <OEPINT> <EPDISD>");
			}
			if (doepint & OTG_FS_STUP) {
				DCC_LOG(LOG_MSG, "[3] <OEPINT> <STUP>");
			}
			/* clear interrupts */
			otg_fs->outep[3].doepint = doepint;
		}
#endif
#endif
	}


	/* RxFIFO non-empty */
	if (gintsts & OTG_FS_RXFLVL) {
		uint32_t grxsts;
		int epnum;
		int len;

		/* 1. On catching an RXFLVL interrupt (OTG_FS_GINTSTS register),
		   the application must read the Receive status pop
		   register (OTG_FS_GRXSTSP). */
		grxsts = otg_fs->grxstsp;

		epnum = OTG_FS_EPNUM_GET(grxsts);
		len = OTG_FS_BCNT_GET(grxsts);

		if (epnum == 0) {
			/* 3. If the received packet’s byte count is not 0, the byte count
			   amount of data is popped from the receive Data FIFO and stored 
			   in memory. If the received packet byte count is 0, no data is 
			   popped from the receive data FIFO. */
			switch (grxsts & OTG_FS_PKTSTS_MSK) {
			case OTG_FS_PKTSTS_GOUT_NACK:
				/* Global OUT NAK (triggers an interrupt) */
				DCC_LOG(LOG_MSG, VT_PSH VT_FYW
						"[0] <RXFLVL> <GOUT_NACK>" VT_POP);
				break;
			case OTG_FS_PKTSTS_OUT_DATA_UPDT: {
				/* OUT data packet received */
				DCC_LOG1(LOG_INFO, VT_PSH VT_FYW
						"[0] <RXFLVL> <OUT_DATA_UPDT> len=%d" VT_POP, len);
				__ep0_rx_pop(drv, len);
				break;
			}
			case OTG_FS_PKTSTS_OUT_XFER_COMP:
				DCC_LOG(LOG_MSG, VT_PSH VT_FYW
						"[0] <RXFLVL> <OUT_XFER_COMP>" VT_POP);
				break;
			case OTG_FS_PKTSTS_SETUP_COMP:
				/* SETUP transaction completed (triggers an interrupt) */
				DCC_LOG(LOG_MSG, VT_PSH VT_FYW
						"[0] <RXFLVL> <SETUP_COMP>" VT_POP);
				break;
			case OTG_FS_PKTSTS_SETUP_UPDT:
#if DEBUG
				/* SETUP data packet received */
				if (len != 8) {
					DCC_LOG(LOG_ERROR, VT_PSH VT_FYW VT_BRI VT_REV  
							"setup data len != 8!" VT_POP);
				}
#endif
				/* Copy the received setup packet into the setup buffer */
				__copy_from_pktbuf(&drv->req, &otg_fs->dfifo[0].pop, 8);

				DCC_LOG3(LOG_INFO, VT_PSH VT_FYW
						"[0] <RXFLVL> <SETUP_UPDT> typ=0x%02x req=0x%02x len=%d"
						VT_POP, 
						drv->req.type, drv->req.request, drv->req.length);

				break;
			}
		} else {
			switch (grxsts & OTG_FS_PKTSTS_MSK) {
			case OTG_FS_PKTSTS_OUT_DATA_UPDT:
				/* OUT data packet received */
				DCC_LOG1(LOG_INFO, VT_PSH VT_FCY
						 "[%d] <RXFLVL> <OUT_DATA_UPDT>" VT_POP , epnum);
				/* 2. The application can mask the RXFLVL interrupt (in
				   OTG_FS_GINTSTS) by writing to RXFLVL = 0 (in
				   OTG_FS_GINTMSK), until it has read the packet from
				   the receive FIFO. */
				otg_fs->gintmsk &= ~OTG_FS_RXFLVLM;
				DCC_LOG(LOG_INFO, VT_PSH VT_FYW VT_REV 
						" FIFO IRQ disabled /!\\ " VT_POP);
				/* Enable SOF interrupts */
//				otg_fs->gintmsk |=  OTG_FS_SOFM;
				stm32f_otg_dev_ep_out(drv, epnum, len);
				break;
			case OTG_FS_PKTSTS_OUT_XFER_COMP:
				DCC_LOG1(LOG_INFO, VT_PSH VT_FCY
						 "[%d] <RXFLVL> <OUT_XFER_COMP>" VT_POP , epnum);
				/* EP enable */
				/* FIXME: not clearing the NAK here reduces the performance,
				   but we to guarantee the class driver will 
				   periodically remove the packets from 
				   the fifo. Otherwise the EP0 will not receive its
				   packets and we end up with a deadlock situation */
//				otg_fs->outep[epnum].doepctl |= OTG_FS_EPENA | OTG_FS_CNAK;
				/* Disable SOF interrupts */
//				otg_fs->gintmsk &= ~OTG_FS_SOFM;
				__ep_out_xfer_comp(drv, epnum);
				break;
			}
		}

