bobmittmann/thinkos/arch/stm32/libstm32f/otg_fs/stm32f-otg_fs_dev.c
		/* 5. After the data payload is popped from the receive FIFO, the
		   RXFLVL interrupt (OTG_FS_GINTSTS) must be unmasked. */
		//	otg_fs->gintmsk |= OTG_FS_RXFLVLM;
	}

	/* Global interrupts 
	 * ----------------------------------------------------------- 
	 */

	if (gintsts & OTG_FS_ENUMDNE) {
		/* Unmask global interrupts */
		otg_fs->gintmsk |=  OTG_FS_IEPINTM | OTG_FS_OEPINTM |
			OTG_FS_IISOIXFRM | OTG_FS_IISOOXFRM | OTG_FS_RXFLVLM;
		/*  Clear global IN NAK */
		otg_fs->dctl |= OTG_FS_CGINAK;

		DCC_LOG(LOG_INFO, VT_PSH VT_FYW VT_REV " FIFO IRQ enabled " VT_POP);

	   /* Wait for the ENUMDNE interrupt in OTG_HS_GINTSTS.
	   This interrupt indicates the end of reset on the USB. On receiving this 
	   interrupt, the application must read the OTG_HS_DSTS register to 
	   determine the enumeration speed and perform the steps listed in 
	   Endpoint initialization on enumeration completion on page 1035.
	   At this point, the device is ready to accept SOF packets and perform 
	   control transfers on control endpoint 0. */
	}

	if (gintsts & OTG_FS_USBRST ) {
		/* end of bus reset */
		DCC_LOG(LOG_WARNING, VT_PSH VT_FYW VT_REV
				"<USBRST> --------------- [DEFAULT]" VT_POP);
		stm32f_otg_dev_reset(drv);
	}

#if DEBUG
	if (gintsts & OTG_FS_SRQINT) {
		/* Session request/new session detected interrupt */
		DCC_LOG(LOG_MSG, VT_PSH VT_FCY 
				"<SRQINT>  [POWERED]" VT_POP);
		otg_fs->gintmsk |= OTG_FS_WUIM | OTG_FS_USBRSTM | OTG_FS_ENUMDNEM |
			OTG_FS_ESUSPM | OTG_FS_USBSUSPM;
	}

	if (gintsts & OTG_FS_OTGINT) {
		uint32_t gotgint = otg_fs->gotgint;
		DCC_LOG(LOG_MSG, "<OTGINT>");
		if (gotgint & OTG_FS_OTGINT) {
			DCC_LOG(LOG_MSG, VT_PSH VT_FCY 
					"<SEDET>  [ATTACHED]" VT_POP);
			otg_fs->gintmsk = OTG_FS_SRQIM | OTG_FS_OTGINT;
		}
		otg_fs->gotgint = gotgint;
	}

	if (gintsts & OTG_FS_ESUSP) {
		uint32_t dsts = otg_fs->dsts;
		(void)dsts;

		DCC_LOG4(LOG_INFO, VT_PSH VT_FCY
				 "<ESUSP> %s%s ENUMSPD=%d %s" VT_POP, 
				 (dsts & OTG_FS_EERR) ? " EERR" : "",
				 (dsts & OTG_FS_SUSPSTS) ? " SUSPSTS" : "",
				 OTG_FS_ENUMSPD_GET(dsts),
				 otg_fs->pcgcctl & OTG_FS_PHYSUSP ? "PHYSUSP" : "");
	}

	if (gintsts & OTG_FS_USBSUSP) {
		uint32_t dsts = otg_fs->dsts;
		(void)dsts;

		DCC_LOG4(LOG_INFO, VT_PSH VT_FCY
				 "<USBSUSP> %s%s ENUMSPD=%d %s" VT_POP, 
				 (dsts & OTG_FS_EERR) ? " EERR" : "",
				 (dsts & OTG_FS_SUSPSTS) ? " SUSPSTS" : "",
				 OTG_FS_ENUMSPD_GET(dsts),
				 otg_fs->pcgcctl & OTG_FS_PHYSUSP ? "PHYSUSP" : "");
	}

	if (gintsts & OTG_FS_GONAKEFF) {
		DCC_LOG(LOG_MSG,  VT_PSH VT_FCY VT_DIM "<GONAKEFF>" VT_POP);
		otg_fs->gintmsk &= ~OTG_FS_GONAKEFFM;
	}

	if (gintsts & OTG_FS_SOF) {
		DCC_LOG(LOG_MSG, VT_PSH VT_FCY VT_DIM "<SOF>" VT_POP);
	}

	if (gintsts & OTG_FS_PTXFE) {
		DCC_LOG(LOG_MSG, VT_PSH VT_FCY VT_DIM "<PTXFE>" VT_POP);
		otg_fs->gintmsk &= ~OTG_FS_PTXFEM;
	}

	if (gintsts & OTG_FS_NPTXFE) {
		DCC_LOG(LOG_MSG, VT_PSH VT_FCY VT_DIM "<NPTXFE>" VT_POP);
		otg_fs->gintmsk &= ~OTG_FS_NPTXFEM;
	}

	if (gintsts & OTG_FS_CIDSCHG) {
		DCC_LOG(LOG_MSG, VT_PSH VT_FCY VT_DIM "<CIDSCHG>" VT_POP);
		otg_fs->gintmsk &= ~OTG_FS_CIDSCHGM ;
	}

	if (gintsts & OTG_FS_WKUPINT) {
		DCC_LOG(LOG_MSG, VT_PSH VT_FCY VT_DIM "<WKUPINT>" VT_POP);
		/* disable resume/wakeup interrupts */
	}

	if (gintsts & OTG_FS_IISOIXFR) {
		DCC_LOG(LOG_MSG, VT_PSH VT_FCY VT_DIM "<IISOIXFR>" VT_POP);
	}

	if (gintsts & OTG_FS_INCOMPISOOUT) {
		DCC_LOG(LOG_MSG, VT_PSH VT_FCY VT_DIM 
				"<INCOMPISOOUT>" VT_POP);
	}

	if (gintsts & OTG_FS_MMIS) {
		DCC_LOG(LOG_MSG, VT_PSH VT_FCY VT_DIM "<MMIS>" VT_POP);
	}
#endif
	/* clear pending interrupts */
	otg_fs->gintsts = gintsts;
}

/* USB device operations */
const struct usb_dev_ops stm32f_otg_fs_ops = {
	.dev_init = (usb_dev_init_t)stm32f_otg_fs_dev_init,
	.ep_init = (usb_dev_ep_init_t)stm32f_otg_dev_ep_init,
	.ep_ctl = (usb_dev_ep_ctl_t)stm32f_otg_dev_ep_ctl,
	.ep_pkt_xmit = (usb_dev_ep_pkt_xmit_t)stm32f_otg_dev_ep_pkt_xmit,
	.ep_pkt_recv = (usb_dev_ep_pkt_recv_t)stm32f_otg_dev_ep_pkt_recv
};

/* USB device driver */
const struct usb_dev stm32f_otg_fs_dev = {
	.priv = (void *)&stm32f_otg_fs_drv0,
	.op = &stm32f_otg_fs_ops
};

#endif /* STM32_ENABLE_OTG_FS && STM32F_OTG_FS */


